In [1]:
import pandas as pd

In [2]:
obj=pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2=pd.Series([4,7,-5,3],index=['d','a','b','c'])

In [7]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [9]:
obj2['d']=6

In [10]:
obj2[['c','d']]

c    3
d    6
dtype: int64

In [11]:
obj2[obj2>1]

d    6
a    7
c    3
dtype: int64

In [12]:
obj2**2

d    36
a    49
b    25
c     9
dtype: int64

In [13]:
obj2[obj2>1]

d    6
a    7
c    3
dtype: int64

In [40]:
import numpy as np

In [15]:
np.exp(obj2)

d     403.428793
a    1096.633158
b       0.006738
c      20.085537
dtype: float64

In [16]:
'k' in obj2

False

In [17]:
sdata={'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}

In [18]:
obj3=pd.Series(sdata)

In [19]:
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [20]:
states=['california','ohio','texas','oregon']

In [21]:
obj4=pd.Series(sdata,index=states)

In [22]:
obj4

california        NaN
ohio          35000.0
texas         71000.0
oregon        16000.0
dtype: float64

In [23]:
pd.isnull(obj4)

california     True
ohio          False
texas         False
oregon        False
dtype: bool

In [24]:
obj4.notnull()

california    False
ohio           True
texas          True
oregon         True
dtype: bool

In [25]:
obj3+obj4

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
utah               NaN
dtype: float64

In [26]:
obj4.name='population'

In [27]:
obj4.index.name="state"

In [28]:
obj4

state
california        NaN
ohio          35000.0
texas         71000.0
oregon        16000.0
Name: population, dtype: float64

In [29]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],'year':[2000,2001,2002,2001,2002,2003],
              'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [30]:
frame=pd.DataFrame(data)

In [31]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [32]:
frame.head(3)

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6

In [33]:
frame.columns=['year','state','pop']

In [34]:
frame

     year  state  pop
0    ohio   2000  1.5
1    ohio   2001  1.7
2    ohio   2002  3.6
3  nevada   2001  2.4
4  nevada   2002  2.9
5  nevada   2003  3.2

In [35]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['a','b','c','d','e','f'])

In [36]:
frame2

   year   state  pop debt
a  2000    ohio  1.5  NaN
b  2001    ohio  1.7  NaN
c  2002    ohio  3.6  NaN
d  2001  nevada  2.4  NaN
e  2002  nevada  2.9  NaN
f  2003  nevada  3.2  NaN

In [37]:
frame2.state

a      ohio
b      ohio
c      ohio
d    nevada
e    nevada
f    nevada
Name: state, dtype: object

In [38]:
frame2.loc['b']

year     2001
state    ohio
pop       1.7
debt      NaN
Name: b, dtype: object

In [41]:
frame2['debt']=np.arange(5)

ValueError: Length of values does not match length of index

In [42]:
frame2['debt']=np.arange(6)

In [43]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5     0
b  2001    ohio  1.7     1
c  2002    ohio  3.6     2
d  2001  nevada  2.4     3
e  2002  nevada  2.9     4
f  2003  nevada  3.2     5

In [44]:
obj[np.arange(3)]

0    4
1    7
2   -5
dtype: int64

In [45]:
val=pd.Series([-1.2,-1.5,-1.7],index=['b','d','e'])

In [46]:
frame2['debt']=val

In [47]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5   NaN
b  2001    ohio  1.7  -1.2
c  2002    ohio  3.6   NaN
d  2001  nevada  2.4  -1.5
e  2002  nevada  2.9  -1.7
f  2003  nevada  3.2   NaN

In [48]:
frame2['east'] = frame2.state=='ohio'

In [49]:
frame2

   year   state  pop  debt   east
a  2000    ohio  1.5   NaN   True
b  2001    ohio  1.7  -1.2   True
c  2002    ohio  3.6   NaN   True
d  2001  nevada  2.4  -1.5  False
e  2002  nevada  2.9  -1.7  False
f  2003  nevada  3.2   NaN  False

In [50]:
del frame2['east']

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
pop = {'nevada':{2001:2.4,2002:2.9},'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [53]:
frame3=pd.DataFrame(pop)

In [54]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [55]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [56]:
pdata = {'ohio':frame3['ohio'][:-1],'nevada':frame3['nevada'][:2]}

In [57]:
pd.DataFrame(pdata)

      ohio  nevada
2001   1.7     2.4
2002   3.6     2.9

In [58]:
frame3.index.name = 'year'

In [59]:
frame3.columns.name = 'state'

In [60]:
frame3

state  nevada  ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [61]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7],
       [2003, 'nevada', 3.2, nan]], dtype=object)

## 5.1.3 索引对象

In [66]:
obj = pd.Series(range(3),index=['a','b','c'])

In [67]:
obj

a    0
b    1
c    2
dtype: int64

In [68]:
ind=obj.index

In [69]:
ind

Index(['a', 'b', 'c'], dtype='object')

In [71]:
labels=pd.Index(np.arange(3))

In [72]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [73]:
obj2=pd.Series([1.5,-2.5,0],index=labels)

In [74]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [75]:
obj2.index is labels

True

In [76]:
lb=pd.Index(range(3))

In [77]:
lb

RangeIndex(start=0, stop=3, step=1)

In [78]:
obj3=pd.Series([1.5,-2.5,0],index=lb)

In [79]:
obj3

0    1.5
1   -2.5
2    0.0
dtype: float64